
&Вместо("ПолучитьЗаполненныйМакет")
Функция ЗагрузкаТЛСПолучитьЗаполненныйМакет(Результат, Область, Компонента)
		
	Если Компонента = Неопределено Тогда
		Компонента = ПодключитьКомпонентуГенерацииИзображенияШтрихкода();
		ПодготовитьКомпонентуГенерацииИзображенияШтрихкода(Компонента);
	КонецЕсли;
	
	стр = "";
	
	Для Каждого м Из Результат.СведенияОВставках Цикл
		стр = стр + СтрШаблон(
			"%1%2 %3-%4-%5/%6,",
			м.Количество,
			ПредставлениеКамняДляПечати(м.ВидКамня),
			ПредставлениеХарактеристики(м.Форма),
			ПредставлениеМассы(м.Масса, м.ЕдиницаИзмерения),
			ПредставлениеХарактеристики(м.Цвет),
			ПредставлениеХарактеристики(м.Качество));
	КонецЦикла;
	
	Стр = Лев(Стр, СтрДлина(Стр) - 1);
	Результат.СведенияОВставках = Стр;
	
	Если Результат.СведенияОСтоимости.Количество() > 0 Тогда
		Результат.СведенияОСтоимости = Результат.СведенияОСтоимости[0].Сумма;
	Иначе
		Результат.СведенияОСтоимости = "";
	КонецЕсли;
	
	Область.Параметры.Заполнить(Результат);
	
	Попытка
		
		ЕстьДМ = Ложь;
		ЕстьШК = Ложь;
		
		Для Каждого т Из Область.Рисунки Цикл
			Если т.Имя = "Datamatrix" Тогда
				ЕстьДМ = Истина;
			КонецЕсли;
			Если т.Имя = "Штрихкод" Тогда
				ЕстьШК = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(Результат.УИН)
			И ЕстьДМ Тогда
			ПараметрыШК = ПараметрыГенерацииШтрихкода();
			ПараметрыШК.ТипКода = 18;
			ПараметрыШК.ШтрихКод = Результат.УИН;
			т = ИзображениеШтрихкода(Компонента, ПараметрыШК);
			Область.Рисунки.Datamatrix.Картинка = т.Картинка;
		КонецЕсли;
		
		Если ЕстьШК Тогда
			Если НЕ ПустаяСтрока(Результат.Штрихкод)
				И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Результат.Штрихкод)
				ИЛИ НЕ ПустаяСтрока(Результат.ТорговаяМарка) И СтрДлина(Результат.ТорговаяМарка) = 13 
				И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Результат.Штрихкод) Тогда
				
				ПараметрыШК = ПараметрыГенерацииШтрихкода();
				ПараметрыШК.Высота = 75;
				ПараметрыШК.Ширина = 500;
				ПараметрыШК.ТипКода = 1;
				Если НЕ ПустаяСтрока(Результат.Штрихкод) Тогда
					ПараметрыШК.ШтрихКод = Результат.Штрихкод;
				иначе
					ПараметрыШК.ШтрихКод = (Результат.ТорговаяМарка);
				КонецЕсли;
				т = ИзображениеШтрихкода(Компонента, ПараметрыШК);
				Область.Рисунки.Штрихкод.Картинка = т.Картинка;
			Иначе
				Область.Рисунки.Штрихкод.Картинка = Новый Картинка();
			КонецЕсли;
		КонецЕсли;
	Исключение
		// обход проверки EDT
		Ошибка = Истина;
		Ошибка = Ошибка ИЛИ Ошибка;
	КонецПопытки;
	
	Возврат Область;

КонецФункции
