#Область ПрограммныйИнтерфейс

// Описывает программный интерфейс контролируемых загружаемых параметров перед началом чтения данных
//
Функция КонтрольПараметровЗагрузки(Параметры) Экспорт
	
	Модуль = ЗФ_ОбщегоНазначениКлиентСервер.МодульПоПрограмме(Параметры.Программа);
	Возврат Модуль.КонтрольПараметровЗагрузки(Параметры);
	
КонецФункции

// Определяет передаваемые параметры по загружаемой программе
// 
Функция ПараметрыПоПрограмме(Объект) Экспорт
	
	Модуль = ЗФ_ОбщегоНазначениКлиентСервер.МодульПоПрограмме(Объект.Программа);
	Параметры = Модуль.ПараметрыПоПрограмме(Объект);
	
	Параметры.Вставить("Программа", Объект.Программа);
	Параметры.Вставить("Клиенты", Объект.Клиенты);
	Параметры.Вставить("Залоги", Объект.Залоги);
	Параметры.Вставить("Вещи", Объект.Вещи);
	Возврат Параметры;
	
КонецФункции

// Выполняет непосредственное чтение данных
// 
Процедура ПрочитатьДанные(Параметры) Экспорт
	
	Модуль = ЗФ_ОбщегоНазначениКлиентСервер.МодульПоПрограмме(Параметры.Программа);
	Модуль.ПрочитатьДанные(Параметры);

КонецПроцедуры

Функция МодульПоПрограмме(Программа) Экспорт
	
	Если Программа = "ТЛС" Тогда
		#Если Клиент Тогда
			Возврат ЗФ_ТЛСКлиентСервер;
		#КонецЕсли
	КонецЕсли;
	
КонецФункции

#КонецОбласти